"""
字符串的切片操作
"""

# 切片操作: str[start:end:step], 左闭右开
name = "0123456789"
print(name[0:4:1])

print("#####################################")

# 同字符串的下标操作一样, 切片操作也可以从右往左数(start、end可以为负数, 负数代表从右往左数)
print(name[-len(name):-1:1])  # 这里只会取到8(即下标-2), 因为左闭右开

print("#####################################")

# start、end都可以省略, 省略了就代表取到末尾(从左往右或者从右往左, 根据step的正负来决定方向)
print(name[0::1])
print(name[:0:-1])

print("#####################################")

# step可以为负, 负数代表从右往左取
print(name[::])  # 省略step, 默认为1
print(name[::1])
print(name[::-1])
print(name[len(name) - 1::-1])
