"""
常见转义字符
"""

# \在行尾: 续行符(代码中写多行, 但是想在输出时在一行输出)
print("续行符")
str1 = "hello " \
       "world"
print(str1)

print("####################################################")

# \n: 换行符
print("换行符")
print("打印完这个就换行\n", end="")
print("下一行")

print("####################################################")

# \': 单引号
print("单引号")
print('这是单引号: \'你好\'')

print("####################################################")

# \": 双引号
print("双引号")
print("这是双引号: \"你好\"")

print("####################################################")

# \t: 制表符
print("制表符")
print("\t这是制表符")

print("####################################################")

# \\: 反斜杠
print("反斜杠")
print("这是反斜杠: \\")
