"""
正则表达式: 匹配多个字符
"""

import re

"""
'*': 匹配0或者任意多个字符
"""
text = '09124abcZGE'
res = re.match('\w*', text)
print(res.group())

print("###########################################################")

"""
'+': 匹配1个或多个字符(最少1个字符)
"""
text = '09124abcZGE'
res = re.match('[0-9a-zA-Z]+', text)  # '+'或者'*'可以和'[]'结合使用
print(res.group())

print("###########################################################")

"""
'?': 匹配0个或1个字符(最多1个字符)
"""
text = '12345'
res = re.match('\d?', text)
print(res.group())

print("###########################################################")

"""
'{m}': 匹配m个字符
"""
text = '12345'
res = re.match('\d{3}', text)
print(res.group())

print("###########################################################")

"""
'{m,n}': 匹配m~n个字符(左闭右闭), 它会去尝试匹配尽量多的字符(最多为n个)
"""
text = '12345'
res = re.match('\d{1,5}', text)
print(res.group())
